src/mathematics/linear_algebra/KBe21math530retAxler6B10.org
#+TITLE: Axler 6.B #10
#+AUTHOR: Exr0n
* Problem
  #+begin_quote
  Suppose $V$ is a real inner product space and $v_1, \ldots, v_m$ is a linearly independent list of vectors in $V$. Prove that there exist exactly $2^m$ orthonormal lists $e_1, \ldots, e_m$ of vectors in $V$ that preserve the prefix spans.
#+end_quote
* Proof Sketch
  In general, during the Gram-Schmidt procedure, both $e_j$ or $-e_j$ preserve orthonormality and prefix span equality. Thus, there are $m$ independant binary choices and thus $2^m$ possibilities.

** But why does the vector space have to be real?
   Because in the real numbers, there are only two scalars with magnitude 1 to choose from on each step. But in the complex numbers, the entire unit circle is fair game, so there are an infinite number of orthonormal bases.
